wip: optimiza documentacion
